MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM3HQFDAFG/mcu.h
/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)


#define TSB_IA_BASE                (PERI_BASE  + 0x003E000UL)
#define TSB_RLM_BASE               (PERI_BASE  + 0x003E400UL)
#define TSB_I2CS_BASE              (PERI_BASE  + 0x003E800UL)
#define TSB_LVD_BASE               (PERI_BASE  + 0x003EC00UL)
#define TSB_DLCD_BASE              (PERI_BASE  + 0x003F200UL)
#define TSB_AGP_BASE               (PERI_BASE  + 0x003FF00UL)
#define TSB_DMAA_BASE              (PERI_BASE  + 0x004C000UL)
#define TSB_DMAB_BASE              (PERI_BASE  + 0x004D000UL)
#define TSB_DA0_BASE               (PERI_BASE  + 0x0054000UL)
#define TSB_DA1_BASE               (PERI_BASE  + 0x0055000UL)
#define TSB_TSPI0_BASE             (PERI_BASE  + 0x0098000UL)
#define TSB_TSPI1_BASE             (PERI_BASE  + 0x0099000UL)
#define TSB_TSPI2_BASE             (PERI_BASE  + 0x009A000UL)
#define TSB_TSPI3_BASE             (PERI_BASE  + 0x009B000UL)
#define TSB_TSPI4_BASE             (PERI_BASE  + 0x009C000UL)
#define TSB_I2C0_BASE              (PERI_BASE  + 0x00A0000UL)
#define TSB_I2C1_BASE              (PERI_BASE  + 0x00A1000UL)
#define TSB_I2C2_BASE              (PERI_BASE  + 0x00A2000UL)
#define TSB_I2C3_BASE              (PERI_BASE  + 0x00A3000UL)
#define TSB_EI2C0_BASE             (PERI_BASE  + 0x00A5000UL)
#define TSB_EI2C1_BASE             (PERI_BASE  + 0x00A6000UL)
#define TSB_EI2C2_BASE             (PERI_BASE  + 0x00A7000UL)
#define TSB_EI2C3_BASE             (PERI_BASE  + 0x00A8000UL)
#define TSB_ADA_BASE               (PERI_BASE  + 0x00B8800UL)
#define TSB_T32A0_BASE             (PERI_BASE  + 0x00BA000UL)
#define TSB_T32A1_BASE             (PERI_BASE  + 0x00BA100UL)
#define TSB_T32A2_BASE             (PERI_BASE  + 0x00BA200UL)
#define TSB_T32A3_BASE             (PERI_BASE  + 0x00BA300UL)
#define TSB_T32A4_BASE             (PERI_BASE  + 0x00BA400UL)
#define TSB_T32A5_BASE             (PERI_BASE  + 0x00BA500UL)
#define TSB_T32A6_BASE             (PERI_BASE  + 0x00BA600UL)
#define TSB_T32A7_BASE             (PERI_BASE  + 0x00BA700UL)
#define TSB_UART0_BASE             (PERI_BASE  + 0x00BB000UL)
#define TSB_UART1_BASE             (PERI_BASE  + 0x00BB100UL)
#define TSB_UART2_BASE             (PERI_BASE  + 0x00BB200UL)
#define TSB_UART3_BASE             (PERI_BASE  + 0x00BB300UL)
#define TSB_UART4_BASE             (PERI_BASE  + 0x00BBD00UL)
#define TSB_UART5_BASE             (PERI_BASE  + 0x00BBE00UL)
#define TSB_UART6_BASE             (PERI_BASE  + 0x00BC400UL)
#define TSB_UART7_BASE             (PERI_BASE  + 0x00BC500UL)
#define TSB_SIWD0_BASE             (PERI_BASE  + 0x00BB400UL)
#define TSB_DNFA_BASE              (PERI_BASE  + 0x00BB600UL)
#define TSB_DNFB_BASE              (PERI_BASE  + 0x00BB700UL)
#define TSB_DNFC_BASE              (PERI_BASE  + 0x00BE000UL)
#define TSB_TSEL0_BASE             (PERI_BASE  + 0x00BB800UL)
#define TSB_TSEL1_BASE             (PERI_BASE  + 0x00BB900UL)
#define TSB_RPAR_BASE              (PERI_BASE  + 0x00BBB00UL)
#define TSB_CRC_BASE               (PERI_BASE  + 0x00BBC00UL)
#define TSB_CMP_BASE               (PERI_BASE  + 0x00BC100UL)
#define TSB_PA_BASE                (PERI_BASE  + 0x00C0000UL)
#define TSB_PB_BASE                (PERI_BASE  + 0x00C0100UL)
#define TSB_PC_BASE                (PERI_BASE  + 0x00C0200UL)
#define TSB_PD_BASE                (PERI_BASE  + 0x00C0300UL)
#define TSB_PE_BASE                (PERI_BASE  + 0x00C0400UL)
#define TSB_PF_BASE                (PERI_BASE  + 0x00C0500UL)
#define TSB_PG_BASE                (PERI_BASE  + 0x00C0600UL)
#define TSB_PH_BASE                (PERI_BASE  + 0x00C0700UL)
#define TSB_PJ_BASE                (PERI_BASE  + 0x00C0800UL)
#define TSB_PK_BASE                (PERI_BASE  + 0x00C0900UL)
#define TSB_PL_BASE                (PERI_BASE  + 0x00C0A00UL)
#define TSB_PM_BASE                (PERI_BASE  + 0x00C0B00UL)
#define TSB_PN_BASE                (PERI_BASE  + 0x00C0C00UL)
#define TSB_PP_BASE                (PERI_BASE  + 0x00C0D00UL)
#define TSB_PR_BASE                (PERI_BASE  + 0x00C0E00UL)
#define TSB_PT_BASE                (PERI_BASE  + 0x00C0F00UL)
#define TSB_PU_BASE                (PERI_BASE  + 0x00C1000UL)
#define TSB_PV_BASE                (PERI_BASE  + 0x00C1100UL)
#define TSB_PW_BASE                (PERI_BASE  + 0x00C1200UL)
#define TSB_RTC_BASE               (PERI_BASE  + 0x00CC000UL)
#define TSB_RMC0_BASE              (PERI_BASE  + 0x00E7000UL)
#define TSB_OFD_BASE               (PERI_BASE  + 0x00F1000UL)
#define TSB_CG_BASE                (PERI_BASE  + 0x00F3000UL)
#define TSB_TRM_BASE               (PERI_BASE  + 0x00F3200UL)
#define TSB_IB_BASE                (PERI_BASE  + 0x00F4E00UL)
#define TSB_IMN_BASE               (PERI_BASE  + 0x00F4F00UL)
#define TSB_PMD0_BASE              (PERI_BASE  + 0x00F6000UL)
#define TSB_EN0_BASE               (PERI_BASE  + 0x00F7000UL)
#define TSB_FC_BASE                (PERI_BASE  + 0x1DFF0000UL)


/* Peripheral declaration */
#define TSB_IA                     ((     TSB_IA_TypeDef *)    TSB_IA_BASE)
#define TSB_RLM                    ((    TSB_RLM_TypeDef *)   TSB_RLM_BASE)
#define TSB_I2CS                   ((   TSB_I2CS_TypeDef *)  TSB_I2CS_BASE)
#define TSB_LVD                    ((    TSB_LVD_TypeDef *)   TSB_LVD_BASE)
#define TSB_DLCD                   ((   TSB_DLCD_TypeDef *)  TSB_DLCD_BASE)
#define TSB_AGP                    ((    TSB_AGP_TypeDef *)   TSB_AGP_BASE)
#define TSB_DMAA                   ((    TSB_DMA_TypeDef *)  TSB_DMAA_BASE)
#define TSB_DMAB                   ((    TSB_DMA_TypeDef *)  TSB_DMAB_BASE)
#define TSB_DA0                    ((     TSB_DA_TypeDef *)   TSB_DA0_BASE)
#define TSB_DA1                    ((     TSB_DA_TypeDef *)   TSB_DA1_BASE)
#define TSB_TSPI0                  ((   TSB_TSPI_TypeDef *) TSB_TSPI0_BASE)
#define TSB_TSPI1                  ((   TSB_TSPI_TypeDef *) TSB_TSPI1_BASE)
#define TSB_TSPI2                  ((   TSB_TSPI_TypeDef *) TSB_TSPI2_BASE)
#define TSB_TSPI3                  ((   TSB_TSPI_TypeDef *) TSB_TSPI3_BASE)
#define TSB_TSPI4                  ((   TSB_TSPI_TypeDef *) TSB_TSPI4_BASE)
#define TSB_I2C0                   ((    TSB_I2C_TypeDef *)  TSB_I2C0_BASE)
#define TSB_I2C1                   ((    TSB_I2C_TypeDef *)  TSB_I2C1_BASE)
#define TSB_I2C2                   ((    TSB_I2C_TypeDef *)  TSB_I2C2_BASE)
#define TSB_I2C3                   ((    TSB_I2C_TypeDef *)  TSB_I2C3_BASE)
#define TSB_EI2C0                  ((   TSB_EI2C_TypeDef *) TSB_EI2C0_BASE)
#define TSB_EI2C1                  ((   TSB_EI2C_TypeDef *) TSB_EI2C1_BASE)
#define TSB_EI2C2                  ((   TSB_EI2C_TypeDef *) TSB_EI2C2_BASE)
#define TSB_EI2C3                  ((   TSB_EI2C_TypeDef *) TSB_EI2C3_BASE)
#define TSB_ADA                    ((     TSB_AD_TypeDef *)   TSB_ADA_BASE)
#define TSB_T32A0                  ((   TSB_T32A_TypeDef *) TSB_T32A0_BASE)
#define TSB_T32A1                  ((   TSB_T32A_TypeDef *) TSB_T32A1_BASE)
#define TSB_T32A2                  ((   TSB_T32A_TypeDef *) TSB_T32A2_BASE)
#define TSB_T32A3                  ((   TSB_T32A_TypeDef *) TSB_T32A3_BASE)
#define TSB_T32A4                  ((   TSB_T32A_TypeDef *) TSB_T32A4_BASE)
#define TSB_T32A5                  ((   TSB_T32A_TypeDef *) TSB_T32A5_BASE)
#define TSB_T32A6                  ((   TSB_T32A_TypeDef *) TSB_T32A6_BASE)
#define TSB_T32A7                  ((   TSB_T32A_TypeDef *) TSB_T32A7_BASE)
#define TSB_UART0                  ((   TSB_UART_TypeDef *) TSB_UART0_BASE)
#define TSB_UART1                  ((   TSB_UART_TypeDef *) TSB_UART1_BASE)
#define TSB_UART2                  ((   TSB_UART_TypeDef *) TSB_UART2_BASE)
#define TSB_UART3                  ((   TSB_UART_TypeDef *) TSB_UART3_BASE)
#define TSB_UART4                  ((   TSB_UART_TypeDef *) TSB_UART4_BASE)
#define TSB_UART5                  ((   TSB_UART_TypeDef *) TSB_UART5_BASE)
#define TSB_UART6                  ((   TSB_UART_TypeDef *) TSB_UART6_BASE)
#define TSB_UART7                  ((   TSB_UART_TypeDef *) TSB_UART7_BASE)
#define TSB_SIWD0                  ((   TSB_SIWD_TypeDef *) TSB_SIWD0_BASE)
#define TSB_DNFA                   ((    TSB_DNF_TypeDef *)  TSB_DNFA_BASE)
#define TSB_DNFB                   ((    TSB_DNF_TypeDef *)  TSB_DNFB_BASE)
#define TSB_DNFC                   ((    TSB_DNF_TypeDef *)  TSB_DNFC_BASE)
#define TSB_TSEL0                  ((   TSB_TSEL_TypeDef *) TSB_TSEL0_BASE)
#define TSB_TSEL1                  ((   TSB_TSEL_TypeDef *) TSB_TSEL1_BASE)
#define TSB_RPAR                   ((   TSB_RPAR_TypeDef *)  TSB_RPAR_BASE)
#define TSB_CRC                    ((    TSB_CRC_TypeDef *)   TSB_CRC_BASE)
#define TSB_CMP                    ((    TSB_CMP_TypeDef *)   TSB_CMP_BASE)
#define TSB_PA                     ((     TSB_PA_TypeDef *)    TSB_PA_BASE)
#define TSB_PB                     ((     TSB_PB_TypeDef *)    TSB_PB_BASE)
#define TSB_PC                     ((     TSB_PC_TypeDef *)    TSB_PC_BASE)
#define TSB_PD                     ((     TSB_PD_TypeDef *)    TSB_PD_BASE)
#define TSB_PE                     ((     TSB_PE_TypeDef *)    TSB_PE_BASE)
#define TSB_PF                     ((     TSB_PF_TypeDef *)    TSB_PF_BASE)
#define TSB_PG                     ((     TSB_PG_TypeDef *)    TSB_PG_BASE)
#define TSB_PH                     ((     TSB_PH_TypeDef *)    TSB_PH_BASE)
#define TSB_PJ                     ((     TSB_PJ_TypeDef *)    TSB_PJ_BASE)
#define TSB_PK                     ((     TSB_PK_TypeDef *)    TSB_PK_BASE)
#define TSB_PL                     ((     TSB_PL_TypeDef *)    TSB_PL_BASE)
#define TSB_PM                     ((     TSB_PM_TypeDef *)    TSB_PM_BASE)
#define TSB_PN                     ((     TSB_PN_TypeDef *)    TSB_PN_BASE)
#define TSB_PP                     ((     TSB_PP_TypeDef *)    TSB_PP_BASE)
#define TSB_PR                     ((     TSB_PR_TypeDef *)    TSB_PR_BASE)
#define TSB_PT                     ((     TSB_PT_TypeDef *)    TSB_PT_BASE)
#define TSB_PU                     ((     TSB_PU_TypeDef *)    TSB_PU_BASE)
#define TSB_PV                     ((     TSB_PV_TypeDef *)    TSB_PV_BASE)
#define TSB_PW                     ((     TSB_PW_TypeDef *)    TSB_PW_BASE)
#define TSB_RTC                    ((    TSB_RTC_TypeDef *)   TSB_RTC_BASE)
#define TSB_RMC0                   ((    TSB_RMC_TypeDef *)  TSB_RMC0_BASE)
#define TSB_OFD                    ((    TSB_OFD_TypeDef *)   TSB_OFD_BASE)
#define TSB_CG                     ((     TSB_CG_TypeDef *)    TSB_CG_BASE)
#define TSB_TRM                    ((    TSB_TRM_TypeDef *)   TSB_TRM_BASE)
#define TSB_IB                     ((     TSB_IB_TypeDef *)    TSB_IB_BASE)
#define TSB_IMN                    ((    TSB_IMN_TypeDef *)   TSB_IMN_BASE)
#define TSB_PMD0                   ((    TSB_PMD_TypeDef *)  TSB_PMD0_BASE)
#define TSB_EN0                    ((     TSB_EN_TypeDef *)   TSB_EN0_BASE)
#define TSB_FC                     ((     TSB_FC_TypeDef *)    TSB_FC_BASE)


/* Bit-Band for Device Specific Peripheral Registers */
#define BITBAND_OFFSET (0x02000000UL)
#define BITBAND_PERI_BASE (PERI_BASE + BITBAND_OFFSET)
#define BITBAND_PERI(addr, bitnum) (BITBAND_PERI_BASE + (((uint32_t)(addr) - PERI_BASE) << 5) + ((uint32_t)(bitnum) << 2))





/* I2C Wakeup control register */
#define TSB_I2CS_WUPCR4_WUPSAFS1                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPCR4,7)))
#define TSB_I2CS_WUPCR5_WUPSAFS2                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2CS->WUPCR5,7)))



/* LCD interface */
#define TSB_DLCD_EN_LCDE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_DLCD->EN,0)))
#define TSB_DLCD_CR1_LCDF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DLCD->CR1,4)))
#define TSB_DLCD_CR2_CLKSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DLCD->CR2,2)))
#define TSB_DLCD_CR2_CONTSEL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DLCD->CR2,3)))
#define TSB_DLCD_CR3_BFLG                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DLCD->CR3,7)))
#define TSB_DLCD_REGBSY_CR1F                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DLCD->REGBSY,0)))
#define TSB_DLCD_REGBSY_CR3F                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DLCD->REGBSY,1)))
#define TSB_DLCD_REGBSY_STCF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DLCD->REGBSY,2)))
#define TSB_DLCD_REGBSY_CONF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_DLCD->REGBSY,3)))


/* Port Driving control */
#define TSB_AGP_REG0_PDNKEEP                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AGP->REG0,0)))
#define TSB_AGP_REG1_REG0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AGP->REG1,0)))
#define TSB_AGP_REG1_REG1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AGP->REG1,1)))
#define TSB_AGP_REG1_REG2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AGP->REG1,2)))
#define TSB_AGP_REG1_REG3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AGP->REG1,3)))
#define TSB_AGP_REG1_REG4                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AGP->REG1,4)))
#define TSB_AGP_REG1_REG5                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AGP->REG1,5)))
#define TSB_AGP_REG1_REG6                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AGP->REG1,6)))


/* DMA Controller */
#define TSB_DMAA_STATUS_MASTER_ENABLE             (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAA->STATUS,0)))
#define TSB_DMAA_CFG_MASTER_ENABLE                (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMAA->CFG,0)))
#define TSB_DMAA_ERRCLR_ERR_CLR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAA->ERRCLR,0)))

